import re

str2 = '''05.27 预约
| 苹果官网混服| 梦落霞 | 雾雨风吟 | 2446 | + 2024.05.30 login: 59.111.6.154:7000 gm: 106.2.70.50:61066
| 硬核 | 百味斋 | 玫瑰饼 | 1221 | + 2024.05.30 login: 59.111.6.14:7000 gm: 106.2.70.50:61061

06.03 预约
| 苹果官网混服| 梦落霞 | 雪峰飞瀑 | 2447 | + 2024.06.06 login: 59.111.130.76:7000 gm: 106.2.70.50:61067
| 硬核 | 百味斋 | 钵钵鸡 | 1222 | + 2024.06.06 login: 59.111.6.18:7000 gm: 106.2.70.50:61062

06.10 预约
| 苹果官网混服| 梦落霞 | 仙音入梦 | 2448 | + 2024.06.13 login: 59.111.130.80:7000 gm: 106.2.70.50:61068
| 硬核 | 百味斋 | 核桃仁 | 1223 | + 2024.06.13 login: 59.111.6.44:7000 gm: 106.2.70.50:61063

06.17 预约
| 苹果官网混服| 梦落霞 | 绿竹猗猗 | 2449 | + 2024.06.20 login: 59.111.130.86:7000 gm: 106.2.70.50:61069
| 硬核 | 百味斋 | 烤鸭包 | 1224 | + 2024.06.20 login: 59.111.6.84:7000 gm: 106.2.70.50:61064

06.24 预约
| 苹果官网混服| 梦落霞 | 云裳剑心 | 2450 | + 2024.06.27 login: 59.111.131.84:7000 gm: 106.2.70.50:61090
| 硬核 | 百味斋 | 竹筒饭 | 1225 | + 2024.06.27 login: 59.111.6.116:7000 gm: 106.2.70.50:61065
'''

# 按行分割字符串
lines = str2.split('\n')

def parse_info(input_str):
    # 正则表达式用于匹配和提取所需的字段
    pattern = r'\|\s*[^|]+\|\s*([^|]+)\s*\|\s*([^|]+)\s*\|\s*(\d+)\s*\|[^+]+\+\s*[^:]+:\s*(\d+\.\d+\.\d+\.\d+):(\d+).*'
    
    # 使用re.search来搜索匹配项
    match = re.search(pattern, input_str)
    
    if match:
        # 提取匹配的各个组
        game_name, server_name, score, ip, port = match.groups()
        # 调整输出格式
        result = f"{score},{server_name.strip()},{game_name.strip()},{ip},{port},1,0"
        return result
    else:
        return None


# 遍历每一行
for line in lines:
    # 可以在这里进行每行的处理
    # 例如，可以打印出来看看
    str = parse_info(line)
    if str:
        print(str)